jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
/* MIT License

Copyright (c) 2026 Jason C. Fain

Permission is hereby granted, free of charge, to any person obtaining a copy
of this software and associated documentation files (the "Software"), to deal
in the Software without restriction, including without limitation the rights
to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
copies of the Software, and to permit persons to whom the Software is
furnished to do so, subject to the following conditions:

The above copyright notice and this permission notice shall be included in all
copies or substantial portions of the Software.

THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
SOFTWARE. */

#pragma once
#include <algorithm>

#include <ArduinoJson.h>
#include <LittleFS.h>

#include "enum.h"
#include "jsonConverters.h"
// // #include "LogHandler.h"
#include "setting.h"
#include "constants.h"
#include "settingConstants.h"
#include "pinMap.h"
#include "espTimerMap.h"
#include "buttonSet.h"
#include "motionProfile.h"

class SettingsFactory
{
public:
    SettingsFactory(SettingsFactory const&) = delete;
    void operator=(SettingsFactory const&) = delete;

    static SettingsFactory* getInstance() {
        static SettingsFactory factory;
        return &factory;
    }

    bool init() 
    {
        //resetAll();
        if(!loadAllFromDisk())
            return false;
        m_initialized = true;
        return true;
    }
    
    const std::vector<SettingFileInfo*> AllSettings = {
        &m_systemFileInfo,
        &m_networkFileInfo,
        &m_commonFileInfo,
        &m_pinsFileInfo// Pins are dependent on system for now. Device type and board type
    };

    // Cached (Requires reboot)
    TCodeVersion getTcodeVersion() const { return tcodeVersion; }
    const char* getTcodeVersionString() const { 
        switch(getTcodeVersion()) {
            // case TCodeVersion::v0_2:
            //     return "TCode v0.2\n";
            //     break;
            case TCodeVersion::v0_3:
                return "TCode v0.3\n";
                break;
            case TCodeVersion::v0_4:
                return "TCode v0.4\n";
                break;
            default:
                return "TCode v?\n";
                break;
        }
    }
    // Cached requires restart
    // DeviceType getDeviceType() const { return m_deviceType; }
    bool restartRequired() const { return m_restartRequired; };
    int getUdpServerPort() const { return udpServerPort; }
    int getWebServerPort() const { return webServerPort; }
    const char* getHostname() const { return hostname; }
    const char* getFriendlyName() const { return friendlyName; }
    const char* getAPModeSSID() const { return apModeSSID; }
    const char* getAPModeIP() const { return apModeIP; }
    // BoardType getBoardType() const { return m_boardType; }

    // Cached (Live update)
    LogLevel getLogLevel() const { return logLevel; }
    std::vector<const char*> getLogIncludes() const { return logIncludes; }
    std::vector<const char*> getLogExcludes() const { return logExcludes; }
    bool getInverseStroke() const { return inverseStroke; }
    bool getInversePitch() const { return inversePitch; }
    bool getValveServo90Degrees() const { return valveServo90Degrees; }
    bool getAutoValve() const { return autoValve; }
    bool getInverseValve() const { return inverseValve; }
    bool getInverseTwist() const { return inverseTwist; }
    bool getContinuousTwist() const { return continuousTwist; }
    int getLubeAmount() const { return lubeAmount; }
    int getBatteryCapacityMax() const { return batteryCapacityMax; }
    int getRightServo_ZERO() const { return RightServo_ZERO; }
    int getLeftServo_ZERO() const { return LeftServo_ZERO; }
    int getRightUpperServo_ZERO() const { return RightUpperServo_ZERO; }
    int getLeftUpperServo_ZERO() const { return LeftUpperServo_ZERO; }
    int getPitchLeftServo_ZERO() const { return PitchLeftServo_ZERO; }
    int getPitchRightServo_ZERO() const { return PitchRightServo_ZERO; }
    int getTwistServo_ZERO() const { return TwistServo_ZERO; }
    int getValveServo_ZERO() const { return ValveServo_ZERO; }
    int getSqueezeServo_ZERO() const { return SqueezeServo_ZERO; }
    const char* getBootButtonCommand() const { return bootButtonCommand; }
    uint16_t getButtonAnalogDebounce() const { return buttonAnalogDebounce; }
    bool getVoiceMuted() const { return voiceMuted; };
	int8_t getVoiceVolume() const { return voiceVolume; };
	int8_t getVoiceWakeTime() const { return voiceWakeTime; };
    bool getVersionDisplayed() const { return versionDisplayed; }
    bool getSleeveTempDisplayed() const { return sleeveTempDisplayed; }
    bool getInternalTempDisplayed() const { return internalTempDisplayed; }
    int getDisplayScreenWidth() const { return Display_Screen_Width; }
    int getDisplayScreenHeight() const { return Display_Screen_Height; }
    bool getBatteryLevelNumeric() const { return batteryLevelNumeric; }
    int getTargetTemp() const { return targetTemp; }
    int getHeatPWM() const { return HeatPWM; }
    int getHoldPWM() const { return HoldPWM; }
    float getHeaterThreshold() const { return heaterThreshold; }
    double getInternalMaxTemp() const { return internalMaxTemp; }
    double getInternalTempForFanOn() const { return internalTempForFanOn; }
    bool getVibTimeoutEnabled() const { return vibTimeoutEnabled; }
    int getVibTimeout() const { return vibTimeout; }
    float getBLDCTwistMultiplier() const { return m_BLDCTwistMultiplier; }
    float getBLDCTwistLimit() const { return m_BLDCTwistLimit; }
    float getBLDCPIDProportionalConst() { return m_BLDCPIDProportionalConst; }
    float getBLDCLowPassFilter() { return m_BLDCLowpassFilter; }

    ButtonSet* getButtonSets() {
        return buttonSets;
    }
    MotionProfile* getMotionProfiles() {
        return motionProfiles;
    }

