jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
    void setMessageCallback(SettingsChangeCallback f)
    {
        LogHandler::debug(m_TAG, "setMessageCallback");
        if (f == nullptr)
        {
            message_callback = 0;
        }
        else
        {
            message_callback = f;
        }
    }

    SettingFileInfo* getFile(const char* settingName) const
    { 
        for(SettingFileInfo* settingsInfo : AllSettings)
        {
            const Setting* setting = settingsInfo->getSetting(settingName);
            if(setting)
                return settingsInfo;
        }
        return 0;
    }

    JsonDocument getNetworkSettings() const
    { 
        return m_networkFileInfo.doc;
    }

    const Setting* getSetting(const char* name) const
    { 
        for(SettingFileInfo* settingsInfo : AllSettings)
        {
            const Setting* setting = settingsInfo->getSetting(name);
            if(setting)
                return setting;
        }
        LogHandler::error(m_TAG, "Setting '%s' not found when calling getSetting", name);
        return 0;
    }

    bool hasProfile(const char* name, const SettingProfile profile, const Setting* setting = 0) const
    {
        if(!setting)
            setting = getSetting(name);
        if(!setting)
            return false;
        return std::find_if(setting->profiles.begin(), setting->profiles.end(), 
                            [profile](const SettingProfile &profileIn) {
                                return profile == profileIn;
        }) != setting->profiles.end();
    }

    template<typename T,
             typename = std::enable_if<!std::is_const<T>::value || std::is_integral<T>::value || std::is_enum<T>::value || std::is_floating_point<T>::value || std::is_same<T, bool>::value>>
    SettingFile getValue(const char* name, T &value)
    {
        if (m_systemFileInfo.doc[name].is<T>()) 
        {
            if(!m_systemFileInfo.initialized) {
                LogHandler::error(m_TAG, "getValue T called before system file initialized");
                return SettingFile::NONE;
            }
            xSemaphoreTake(m_systemSemaphore, portTICK_PERIOD_MS);
            value = m_systemFileInfo.doc[name].as<T>();
            xSemaphoreGive(m_systemSemaphore);
            return SettingFile::System;
        } 
        else if (m_networkFileInfo.doc[name].is<T>()) 
        {
            if(!m_networkFileInfo.initialized) {
                LogHandler::error(m_TAG, "getValue T called before network file initialized");
                return SettingFile::NONE;
            }
            xSemaphoreTake(m_networkSemaphore, portTICK_PERIOD_MS);
            value = m_networkFileInfo.doc[name].as<T>();
            xSemaphoreGive(m_networkSemaphore);
            return SettingFile::Network;
        } 
        else if (m_commonFileInfo.doc[name].is<T>()) 
        {
            if(!m_commonFileInfo.initialized) {
                LogHandler::error(m_TAG, "getValue T called before common file initialized");
                return SettingFile::NONE;
            }
            xSemaphoreTake(m_commonSemaphore, portTICK_PERIOD_MS);
            value = m_commonFileInfo.doc[name].as<T>();
            xSemaphoreGive(m_commonSemaphore);
            return SettingFile::Common;
        }    
        else if (m_pinsFileInfo.doc[name].is<T>()) 
        {
            if(!m_pinsFileInfo.initialized) {
                LogHandler::error(m_TAG, "getValue T called before pins file initialized");
                return SettingFile::NONE;
            }
            xSemaphoreTake(m_pinSemaphore, portTICK_PERIOD_MS);
            value = m_pinsFileInfo.doc[name].as<T>();
            xSemaphoreGive(m_pinSemaphore);
            return SettingFile::Pins;
        }    
        else
        {
            LogHandler::error(m_TAG, "Get value key not found: %s", name);
            return SettingFile::NONE;
        }
    }
    
    SettingFile getValue(const char* name, char* value, size_t len)
    {
        const char* constvalue = getValue(name);
        if(!constvalue) {
            return SettingFile::NONE;
        }
        strncpy(value, constvalue, len);
        if (m_systemFileInfo.doc[name].is<const char*>()) 
        {
            if(!m_systemFileInfo.initialized) {
                LogHandler::error(m_TAG, "getValue char* len called before system file initialized");
                return SettingFile::NONE;
            }
            LogHandler::debug(m_TAG, "getValue char* len %s: value: %s", name, value);
            return SettingFile::System;
        } 
        else if (m_networkFileInfo.doc[name].is<const char*>()) 
        {
            if(!m_networkFileInfo.initialized) {
                LogHandler::error(m_TAG, "getValue char* len called before network file initialized");
                return SettingFile::NONE;
            }
            LogHandler::debug(m_TAG, "getValue char* len %s: value: %s", name, strcmp(name, AP_MODE_PASS) || strcmp(name, WIFI_PASS_SETTING) || !strcmp(value, WIFI_PASS_DONOTCHANGE_DEFAULT) ? value : "<Redacted>");
            return SettingFile::Network;
        } 
        else if (m_commonFileInfo.doc[name].is<const char*>()) 
        {
            if(!m_commonFileInfo.initialized) {
                LogHandler::error(m_TAG, "getValue char* len called before common file initialized");
                return SettingFile::NONE;
            }
            LogHandler::debug(m_TAG, "getValue char* len %s: value: %s", name, value);
            return SettingFile::Common;
        }
        return SettingFile::NONE;
    }
    
    const char* getValue(const char* name)
    {
        if (m_systemFileInfo.doc[name].is<const char*>()) 
        {
            if(!m_systemFileInfo.initialized) {
                LogHandler::error(m_TAG, "getValue char* called before system file initialized");
                return 0;
            }
            xSemaphoreTake(m_systemSemaphore, portTICK_PERIOD_MS);
            const char* constvalue = m_systemFileInfo.doc[name];
            LogHandler::debug(m_TAG, "getValue char* common: %s: constvalue: %s", name, constvalue);
            xSemaphoreGive(m_systemSemaphore);
            return constvalue;
        } 
        else if (m_networkFileInfo.doc[name].is<const char*>()) 
        {
            if(!m_networkFileInfo.initialized) {
                LogHandler::error(m_TAG, "getValue char* called before network file initialized");
                return 0;
            }
            xSemaphoreTake(m_networkSemaphore, portTICK_PERIOD_MS);
            const char* constvalue = m_networkFileInfo.doc[name];
            LogHandler::debug(m_TAG, "getValue char* wifi: %s: constvalue: %s", name, strcmp(name, AP_MODE_PASS) || strcmp(name, WIFI_PASS_SETTING) || !strcmp(constvalue, WIFI_PASS_DONOTCHANGE_DEFAULT) ? constvalue : "<Redacted>");
            xSemaphoreGive(m_networkSemaphore);
            return constvalue;
        } 
        else if (m_commonFileInfo.doc[name].is<const char*>()) 
        {
            if(!m_commonFileInfo.initialized) {
                LogHandler::error(m_TAG, "getValue char* called before common file initialized");
                return 0;
            }
            xSemaphoreTake(m_commonSemaphore, portTICK_PERIOD_MS);
            const char* constvalue = m_commonFileInfo.doc[name];
            LogHandler::debug(m_TAG, "getValue char* common: %s: constvalue: %s", name, constvalue);
            xSemaphoreGive(m_commonSemaphore);
            return constvalue;
        }    
        else
        {
            LogHandler::error(m_TAG, "Get value key not found: %s", name);
        }
        return 0;
    }
    SettingFile getValueVector(const char* name, std::vector<const char*> &value)
    {
        LogHandler::debug("Getting vector string values: %s", name);
        SettingFileInfo* fileInfo = getFile(name);
        if(!fileInfo) {
            LogHandler::error("Key not found in settings: %s", name);
            return SettingFile::NONE;
        }
        if(!fileInfo->initialized) {
            LogHandler::error(m_TAG, "getValueVector char* called before initialized");
            return SettingFile::NONE;
        }
        //const Setting* setting = fileInfo->getSetting(name);
        JsonArray array = fileInfo->doc[name].as<JsonArray>();
        for (size_t i = 0; i < array.size(); i++)
        {
            value.push_back(array[i].as<const char*>());
        }
        
