jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
        return fileInfo->file;
    }
    SettingFile getValueVector(const char* name, std::vector<int> &value)
    {
        LogHandler::debug("Getting vector int values: %s", name);
        SettingFileInfo* fileInfo = getFile(name);
        if(!fileInfo) {
            LogHandler::error("Key not found in settings: %s", name);
            return SettingFile::NONE;
        }
        if(!fileInfo->initialized) {
            LogHandler::error(m_TAG, "getValueVector int called before initialized");
            return SettingFile::NONE;
        }
        //const Setting* setting = fileInfo->getSetting(name);
        JsonArray array = fileInfo->doc[name].as<JsonArray>();
        for (size_t i = 0; i < array.size(); i++)
        {
            value.push_back(array[i].as<int>());
        }
        
        return fileInfo->file;
    }
    
    PinMap* getPins() 
    {
        return m_currentPinMap;
    }

    template<typename T,
             typename = std::enable_if<std::is_integral<T>::value || std::is_floating_point<T>::value || std::is_same<T, bool>::value>>
    SettingFile setValue(const char* name, const T &value) 
    {
        LogHandler::debug(m_TAG, "Enter setValue T: %s", name);
        
        if (m_systemFileInfo.doc[name].is<T>())
        {
            if(!m_systemFileInfo.initialized) {
                LogHandler::error(m_TAG, "setValue T called before system file initialized");
                return SettingFile::NONE;
            }
            T currentValue = m_systemFileInfo.doc[name].as<T>();
            if(currentValue != value) {
                LogHandler::debug(m_TAG, "Change system value T: %s", name);
                xSemaphoreTake(m_systemSemaphore, portTICK_PERIOD_MS);
                checkRestartRequired(&m_systemFileInfo, name);
                m_systemFileInfo.doc[name] = value;
                loadSystemLiveCache(name);
                xSemaphoreGive(m_systemSemaphore);
            }
            return SettingFile::System;
        }
        else if (m_networkFileInfo.doc[name].is<T>())
        {
            if(!m_networkFileInfo.initialized) {
                LogHandler::error(m_TAG, "setValue T called before network file initialized");
                return SettingFile::NONE;
            }
            T currentValue = m_networkFileInfo.doc[name].as<T>();
            if(currentValue != value) {
                LogHandler::debug(m_TAG, "Change wifi value T: %s", name);
                xSemaphoreTake(m_networkSemaphore, portTICK_PERIOD_MS);
                checkRestartRequired(&m_networkFileInfo, name);
                m_networkFileInfo.doc[name] = value;
                loadNetworkLiveCache(name);
                xSemaphoreGive(m_networkSemaphore);
            }
            return SettingFile::Network;
        }
        else if (m_commonFileInfo.doc[name].is<T>())
        {
            if(!m_commonFileInfo.initialized) {
                LogHandler::error(m_TAG, "setValue T called before common file initialized");
                return SettingFile::NONE;
            }
            T currentValue = m_commonFileInfo.doc[name].as<T>();
            if(currentValue != value) {
                LogHandler::debug(m_TAG, "Change common value T: %s", name);
                xSemaphoreTake(m_commonSemaphore, portTICK_PERIOD_MS);
                checkRestartRequired(&m_commonFileInfo, name);
                m_commonFileInfo.doc[name] = value;
                loadCommonLiveCache(name);
                xSemaphoreGive(m_commonSemaphore);
            }
            return SettingFile::Common;
        }
        else if (m_pinsFileInfo.doc[name].is<T>())
        {
            if(!m_pinsFileInfo.initialized) {
                LogHandler::error(m_TAG, "setValue T called before pins file initialized");
                return SettingFile::NONE;
            }
            T currentValue = m_pinsFileInfo.doc[name].as<T>();
            if(currentValue != value) {
                LogHandler::debug(m_TAG, "Change pin value T: %s", name);
                xSemaphoreTake(m_pinSemaphore, portTICK_PERIOD_MS);
                checkRestartRequired(&m_pinsFileInfo, name);
                m_pinsFileInfo.doc[name] = value;
                loadPinLiveCache();
                xSemaphoreGive(m_pinSemaphore);
            }
            return SettingFile::Pins;
        }
        LogHandler::error(m_TAG, "Set value key not found");
        return SettingFile::NONE;
    }

    SettingFile setValue(const char* name, const char* value) 
    {
        LogHandler::debug(m_TAG, "Enter setValue const char*: %s", name);
        SettingFileInfo* fileInfo = getFile(name);
        if(!fileInfo) {
            LogHandler::error(m_TAG, "Set value key not found");
            return SettingFile::NONE;
        }
        if(!fileInfo->initialized) {
            LogHandler::error(m_TAG, "setValue const char* called before initialized");
            return SettingFile::NONE;
        }
        const char* currentValue = fileInfo->doc[name].as<const char*>();
        if(fileInfo->doc[name].isNull() || strcmp(currentValue, value)) {
            LogHandler::debug(m_TAG, "Change value: %s old value: %s new value: %s", name, currentValue, strcmp(name, AP_MODE_PASS) || strcmp(name, WIFI_PASS_SETTING) || !strcmp(value, WIFI_PASS_DONOTCHANGE_DEFAULT) ? value : "<Redacted>");
            fileInfo->doc[name] = value;
            checkRestartRequired(fileInfo, name);
            if(fileInfo->file == SettingFile::System) {
                loadSystemLiveCache(name);
            } if(fileInfo->file == SettingFile::Common) {
                loadCommonLiveCache(name);
            }
        }
        return fileInfo->file;
    }

    template <typename T>
    SettingFile setValue(const char* name, const std::vector<T> &value) 
    {
        LogHandler::debug(m_TAG, "Set vector value: %s", name);
        SettingFileInfo* fileInfo = getFile(name);
        if(!fileInfo->initialized) {
            LogHandler::error(m_TAG, "setValue vector T called before initialized");
            return SettingFile::NONE;
        }
        if(!fileInfo) {
            LogHandler::error(m_TAG, "Set value key not found");
            return SettingFile::NONE;
        }
        fileInfo->doc[name] = value;
        checkRestartRequired(fileInfo, name);
        if(fileInfo->file == SettingFile::System) {
            loadSystemLiveCache(name);
        } if(fileInfo->file == SettingFile::Common) {
            loadCommonLiveCache(name);
        }
        return fileInfo->file;
    }

