jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
    void defaultValue(const char* name) 
    {
        LogHandler::debug(m_TAG, "Default: %s", name);
        SettingFileInfo* fileInfo = getFile(name);
        if(!fileInfo->initialized) {
            LogHandler::error(m_TAG, "defaultValue called before initialized");
            return;
        }
        if(!fileInfo) {
            LogHandler::error(m_TAG, "Default value key not found");
            return;
        }
        const Setting* setting = fileInfo->getSetting(name);
        checkRestartRequired(setting, name);
        defaultToJson(setting, fileInfo->doc);
        if(fileInfo->file == SettingFile::System) {
            loadSystemLiveCache(name);
        } if(fileInfo->file == SettingFile::Common) {
            loadCommonLiveCache(name);
        }
        switch(fileInfo->file)
        {
            case SettingFile::Network:
            saveNetwork();
            break;
            case SettingFile::Common:
            saveCommon();
            break;
            case SettingFile::Pins:
            savePins();
            break;
            case SettingFile::ButtonSet:
            //saveButtonSet();
            break;
            case SettingFile::MotionProfile:
            //saveMotionProfiles();
            break;
            default:
                LogHandler::error(m_TAG, "Set default value key not found: ", name);
            break;
        }
    }

    bool saveAllToDisk(JsonObject fromJson = JsonObject())
    {
        for(SettingFileInfo* settingsInfo : AllSettings)
        {
            if(!saveToDisk(*settingsInfo, fromJson))
                return false;
        }
        // loadCommonLiveCache();
        // loadPinCache();
        return true;;
    }
    bool resetAll() 
    {
        for(SettingFileInfo* settingsInfo : AllSettings)
        {
            if(!deleteJsonFile(settingsInfo->path))
                return false;
        }
        if(!deleteJsonFile(MOTION_PROFILE_SETTINGS_PATH))
            return false;
        if(!deleteJsonFile(BUTTON_SETTINGS_PATH))
            return false;
        // for(SettingFileInfo* settingsInfo : AllSettings)
        // {
        //     if(!loadDefault(*settingsInfo))
        //         return false;
        // }
        return true;
    }

    bool save(SettingFile file, JsonObject fromJson = JsonObject()) {
        switch(file)
        {
            case SettingFile::Common:
                if(!saveCommon(fromJson)) {
                    return false;
                }
                break;
            case SettingFile::Network:
                if(!saveNetwork(fromJson)) {
                    return false;
                }
            case SettingFile::Pins:
                if(!savePins(fromJson)) {
                    return false;
                }
                break;
            default: {
                LogHandler::error(m_TAG, "Invalid or unsuported file: %ld", (int)file);
                return false;
            }
        }
        return true;
    }

    bool saveSystem(JsonObject fromJson = JsonObject())
    {
        xSemaphoreTake(m_systemSemaphore, portTICK_PERIOD_MS);
        bool ret = saveToDisk(m_systemFileInfo, fromJson);
        xSemaphoreGive(m_systemSemaphore);
        if(ret) {
            loadSystemLiveCache();
        }
        return ret;
    }
    bool resetSystem()
    {
        xSemaphoreTake(m_systemSemaphore, portTICK_PERIOD_MS);
        bool ret = loadDefault(m_systemFileInfo);
        xSemaphoreGive(m_systemSemaphore);
        if(ret)
            loadSystemLiveCache();
        return ret;
    }
    bool saveCommon(JsonObject fromJson = JsonObject())
    {
        xSemaphoreTake(m_commonSemaphore, portTICK_PERIOD_MS);
        bool ret = saveToDisk(m_commonFileInfo, fromJson);
        xSemaphoreGive(m_commonSemaphore);
        if(ret) {
            loadCommonLiveCache();
        }
        return ret;
    }
    bool resetCommon()
    {
        xSemaphoreTake(m_commonSemaphore, portTICK_PERIOD_MS);
        bool ret = loadDefault(m_commonFileInfo);
        xSemaphoreGive(m_commonSemaphore);
        if(ret)
            loadCommonLiveCache();
        return ret;
    }

    bool saveNetwork(JsonObject fromJson = JsonObject())
    {
        xSemaphoreTake(m_networkSemaphore, portTICK_PERIOD_MS);
        if(!fromJson.isNull()) 
        {
            const char* pass = fromJson[WIFI_PASS_SETTING] | DECOY_PASS;
            if(!strcmp(pass, DECOY_PASS)) 
            {
                char passTemp[WIFI_PASS_LEN];
                getValue(WIFI_PASS_SETTING, passTemp, sizeof(passTemp));
                fromJson[WIFI_PASS_SETTING] = passTemp;
            }
            const char* appass = fromJson[AP_MODE_PASS] | DECOY_PASS;
            if(!strcmp(appass, DECOY_PASS)) 
            {
                char passTemp[WIFI_PASS_LEN];
                getValue(AP_MODE_PASS, passTemp, sizeof(passTemp));
                fromJson[AP_MODE_PASS] = passTemp;
            }
        }
        bool ret = saveToDisk(m_networkFileInfo, fromJson);
        xSemaphoreGive(m_networkSemaphore);
        return ret;
    }
    bool resetNetwork()
    {
        xSemaphoreTake(m_networkSemaphore, portTICK_PERIOD_MS);
        bool ret = loadDefault(m_networkFileInfo);
        xSemaphoreGive(m_networkSemaphore);
        return ret;
    }
    
    bool savePins(JsonObject fromJson = JsonObject())
    {
        xSemaphoreTake(m_pinSemaphore, portTICK_PERIOD_MS);
        bool ret = saveToDisk(m_pinsFileInfo, fromJson);
        xSemaphoreGive(m_pinSemaphore);
        if(ret)
            loadPinCache();
        return ret;
    }
    bool resetPins()
    {
        xSemaphoreTake(m_pinSemaphore, portTICK_PERIOD_MS);
        bool ret = loadDefaultPins();
        xSemaphoreGive(m_pinSemaphore);
        if(ret)
            loadPinCache();
        return ret;
    }

    void loadSystemLiveCache(const char* name = 0) {
        if(!m_systemFileInfo.initialized) {
            LogHandler::error(m_TAG, "loadSystemLiveCache called before initialized");
            return;
        }
        bool targeted = !!name;
        if(!name || !strcmp(name, LOG_LEVEL_SETTING)) {
            getValue(LOG_LEVEL_SETTING, logLevel);
            if(targeted) {initSystemMessages(name); return;}
        }
        if(!name || !strcmp(name, LOG_INCLUDETAGS)) {
            getValue(LOG_INCLUDETAGS, logIncludes);
            if(targeted) {initSystemMessages(name); return;}
        }
        if(!name || !strcmp(name, LOG_INCLUDETAGS)) {
            getValue(LOG_EXCLUDETAGS, logExcludes);
            if(targeted) {initSystemMessages(name); return;}
        }
        initSystemMessages();
    }

    void loadNetworkLiveCache(const char* name = 0) {}

    void loadPinLiveCache(const char* name = 0) {}
    
    void loadCommonLiveCache(const char* name = 0) {
        if(!m_commonFileInfo.initialized) {
            LogHandler::error(m_TAG, "loadCommonLiveCache called before initialized");
            return;
        }
        bool targeted = !!name;
        if(!name || !strcmp(name, INVERSE_STROKE)) {
            getValue(INVERSE_STROKE, inverseStroke);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, INVERSE_PITCH)) {
            getValue(INVERSE_PITCH, inversePitch);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, INVERSE_TWIST)) {
            getValue(INVERSE_TWIST, inverseTwist);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, VALVE_SERVO_90DEGREES)) {
            getValue(VALVE_SERVO_90DEGREES, valveServo90Degrees);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, AUTO_VALVE)) {
            getValue(AUTO_VALVE, autoValve);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, INVERSE_VALVE)) {
            getValue(INVERSE_VALVE, inverseValve);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, CONTINUOUS_TWIST)) {
            getValue(CONTINUOUS_TWIST, continuousTwist);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, LUBE_AMOUNT)) {
            getValue(LUBE_AMOUNT, lubeAmount);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, BATTERY_CAPACITY_MAX)) {
            getValue(BATTERY_CAPACITY_MAX, batteryCapacityMax);
            if(targeted) {initCommonMessages(name); return;}
        }
    #ifdef MOTOR_TYPE_SERVO
        if(!name || !strcmp(name, RIGHT_SERVO_ZERO)) {
            getValue(RIGHT_SERVO_ZERO, RightServo_ZERO);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, LEFT_SERVO_ZERO)) {
            getValue(LEFT_SERVO_ZERO, LeftServo_ZERO);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, RIGHT_UPPER_SERVO_ZERO)) {
            getValue(RIGHT_UPPER_SERVO_ZERO, RightUpperServo_ZERO);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, LEFT_UPPER_SERVO_ZERO)) {
            getValue(LEFT_UPPER_SERVO_ZERO, LeftUpperServo_ZERO);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, PITCH_LEFT_SERVO_ZERO)) {
            getValue(PITCH_LEFT_SERVO_ZERO, PitchLeftServo_ZERO);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, PITCH_RIGHT_SERVO_ZERO)) {
            getValue(PITCH_RIGHT_SERVO_ZERO, PitchRightServo_ZERO);
            if(targeted) {initCommonMessages(name); return;}
        }
    #elif defined MOTOR_TYPE_BLDC
        if(!name || !strcmp(name, BLDC_TWIST_MULTIPLIER)) {
            getValue(BLDC_TWIST_MULTIPLIER, m_BLDCTwistMultiplier);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, BLDC_TWIST_MULTIPLIER)) {
            getValue(BLDC_TWIST_MULTIPLIER, m_BLDCTwistMultiplier);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, BLDC_TWIST_LIMIT)) {
            getValue(BLDC_TWIST_LIMIT, m_BLDCTwistLimit);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, BLDC_PID_PROPORTIONAL_CONST)) {
            getValue(BLDC_PID_PROPORTIONAL_CONST, m_BLDCPIDProportionalConst);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, BLDC_LOWPASS_FILTER)) {
            getValue(BLDC_LOWPASS_FILTER, m_BLDCLowpassFilter);
            if(targeted) {initCommonMessages(name); return;}
        }
    #endif
        if(!name || !strcmp(name, TWIST_SERVO_ZERO)) {
            getValue(TWIST_SERVO_ZERO, TwistServo_ZERO);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, VALVE_SERVO_ZERO)) {
            getValue(VALVE_SERVO_ZERO, ValveServo_ZERO);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, SQUEEZE_ZERO)) {
            getValue(SQUEEZE_ZERO, SqueezeServo_ZERO);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, BOOT_BUTTON_COMMAND)) {
            bootButtonCommand[0] = {0};
            getValue(BOOT_BUTTON_COMMAND, bootButtonCommand, BOOT_BUTTON_COMMAND_LEN);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, VERSION_DISPLAYED)) {
            getValue(VERSION_DISPLAYED, versionDisplayed);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, SLEEVE_TEMP_DISPLAYED)) {
            getValue(SLEEVE_TEMP_DISPLAYED, sleeveTempDisplayed);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, INTERNAL_TEMP_DISPLAYED)) {
            getValue(INTERNAL_TEMP_DISPLAYED, internalTempDisplayed);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, DISPLAY_SCREEN_WIDTH)) {
            getValue(DISPLAY_SCREEN_WIDTH, Display_Screen_Width);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, DISPLAY_SCREEN_HEIGHT)) {
            getValue(DISPLAY_SCREEN_HEIGHT, Display_Screen_Height);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, BATTERY_LEVEL_NUMERIC)) {
            getValue(BATTERY_LEVEL_NUMERIC, batteryLevelNumeric);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, TARGET_TEMP)) {
            getValue(TARGET_TEMP, targetTemp);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, HEAT_PWM)) {
            getValue(HEAT_PWM, HeatPWM);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, HOLD_PWM)) {
            getValue(HOLD_PWM, HoldPWM);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, HEATER_THRESHOLD)) {
            getValue(HEATER_THRESHOLD, heaterThreshold);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, INTERNAL_MAX_TEMP)) {
            getValue(INTERNAL_MAX_TEMP, internalMaxTemp);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, INTERNAL_TEMP_FOR_FANON)) {
            getValue(INTERNAL_TEMP_FOR_FANON, internalTempForFanOn);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, VOICE_MUTED)) {
            getValue(VOICE_MUTED, voiceMuted);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, VOICE_VOLUME)) {
            getValue(VOICE_VOLUME, voiceVolume);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, VOICE_WAKE_TIME)) {
            getValue(VOICE_WAKE_TIME, voiceWakeTime);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, VIB_TIMEOUT)) {
            getValue(VIB_TIMEOUT, vibTimeout);
            if(targeted) {initCommonMessages(name); return;}
        }
        if(!name || !strcmp(name, VIB_TIMEOUT_ENABLED)) {
            getValue(VIB_TIMEOUT_ENABLED, vibTimeoutEnabled);
            if(targeted) {initCommonMessages(name); return;}
        }
        initCommonMessages();
    }

