jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
    bool changeBoardType(int8_t value)
    {
        if(value >= (int8_t)BoardType::MAX || value < 0)
        {
			LogHandler::error(m_TAG, "[changeBoardType] Invalid value: %ld. Valid board types are %s", value, BOARD_TYPES_HELP);
            return false;
        }
        BoardType boardType = (BoardType)value;
        MotorType motorType;
        getValue(MOTOR_TYPE_SETTING, motorType);
        if(motorType == MotorType::BLDC)
        {
            if (boardType == BoardType::CRIMZZON || boardType == BoardType::ISAAC)
            {
                LogHandler::error(m_TAG, "[changeBoardType] Invalid board type for current motor");
                return false;
            }
        }
        if(boardType == BoardType::CRIMZZON || boardType == BoardType::ISAAC) 
        {
            setValue(DEVICE_TYPE, DeviceType::SR6);
        } 
        else if(boardType == BoardType::SSR1PCB) 
        {
            setValue(DEVICE_TYPE, DeviceType::SSR1);
            setValue(BLDC_MOTORA_ENCODER, BLDCEncoderType::MT6701);
        }
        LogHandler::info(m_TAG, "[changeBoardType] Settings pinout default");
        setValue(BOARD_TYPE_SETTING, boardType);
        return saveSystem() && saveCommon() && defaultPinout();
    }

    bool changeDeviceType(int8_t value)
    {
        if(value >= (int8_t)DeviceType::MAX || value < 0)
        {
			LogHandler::error(m_TAG, "[changeDeviceType] Invalid value: %ld. Valid device types are %s", value, DEVICE_TYPES_HELP);
            return false;
        }
        DeviceType newType = (DeviceType)value;
        MotorType motorType;
        getValue(MOTOR_TYPE_SETTING, motorType);
        if(motorType == MotorType::Servo)
        {
            if (newType == DeviceType::SSR1 || newType == DeviceType::SSR2)
            {
                LogHandler::error(m_TAG, "[changeDeviceType] Invalid device type (%ld) for current motor. Valid device types are %s", value, DEVICE_TYPES_HELP);
                return false;
            }
        }
        else if(motorType == MotorType::BLDC)
        {
            if (newType != DeviceType::NONE && newType != DeviceType::SSR1 && newType != DeviceType::SSR2)
            {
                LogHandler::error(m_TAG, "[changeDeviceType] Invalid device type (%ld) for current motor. Valid device types are %s", value, DEVICE_TYPES_HELP);
                return false;
            }
        }
        LogHandler::info(m_TAG, "[changeDeviceType] Settings pinout default");
        setValue(DEVICE_TYPE, newType);
        bool retValue = saveSystem() && saveCommon() && defaultPinout();
        // Override for new device type AFTER default!
        if(motorType == MotorType::BLDC)
        {
            if (newType == DeviceType::SSR2)
            {
                LogHandler::info(m_TAG, "[changeDeviceType] Overriding default settings for SSR2");
                setValue(BLDC_MOTORA_ENCODER, BLDCEncoderType::SPI);
                setValue(BLDC_MOTORB_ENCODER, BLDCEncoderType::SPI);
                setValue(BLDC_MOTORA_VOLTAGE, 12.0f);
                setValue(BLDC_MOTORA_SUPPLY, 12.0f);
                setValue(BLDC_MOTORB_VOLTAGE, 12.0f);
                setValue(BLDC_MOTORB_SUPPLY, 12.0f);
                retValue = saveCommon();
            }
            PinMapSSR* pinMap = PinMapSSR::getInstance();
            pinMap->setDeviceType(newType);
            m_pinsFileInfo.initialized = true;
            syncSSRAndCommonPinsToDisk(pinMap);
            loadDefaultChannelsForDeviceType();
            retValue = saveToDisk(m_pinsFileInfo);
        }
        return retValue;
    }

    bool defaultPinout() {
		//setBoardPinout();
        if(!resetPins())
            return false;
        const PinMap* pinMap = getPins();
        for(int i = 0; i < MAX_BUTTON_SETS; i++) {
            buttonSets[i].pin = pinMap->buttonSetPin(i);
        }
        return savePins();
    }

    bool addLastBootReason(const char* value)
    {
        SettingFileInfo debugInfo = getDebugInfo();
        if(load(debugInfo))
        {
            JsonArray reasons = debugInfo.doc[DEBUG_INFO_LAST_BOOT_REASONS].as<JsonArray>();
            if(reasons.isNull()) 
            {
                reasons = debugInfo.doc[DEBUG_INFO_LAST_BOOT_REASONS].to<JsonArray>();
            }
            else if(reasons.size() > LAST_BOOT_REASONS_MAX_DEFAULT) 
            {
                reasons.remove(0);
            }
            int index = 1;
            if(reasons.size() > 0)
            {
                JsonObject lastReason = reasons[reasons.size() -1].as<JsonObject>();
                index = lastReason["eventID"].as<int>() + 1;
            }
            JsonObject obj = reasons.add<JsonObject>();
            obj["eventID"] = index;
            obj["reason"] = value;
            if(saveToDisk(debugInfo))
                return true;
        }

        return false;
    }

    bool resetLastBootReason()
    {
        SettingFileInfo debugInfo = getDebugInfo();
        if(load(debugInfo))
        {
            debugInfo.doc[DEBUG_INFO_LAST_BOOT_REASONS].to<JsonArray>();
            if(saveToDisk(debugInfo))
                return true;
        }
        return false;
    }

    SettingFileInfo getDebugInfo() 
    {
        return 
        {
            false, DEBUG_INFO_PATH, SettingFile::DebugInfo, JsonDocument(), 0, 0,
            {
                { DEBUG_INFO_LAST_BOOT_REASONS, "Last boot reasons", "The reasons for boot up or reboot.", SettingType::ArrayString, DEBUG_INFO_LAST_BOOT_REASONS_DEFAULT, RestartRequired::YES, { SettingProfile::System, SettingProfile::Readonly }},
            }
        };
    }
    
private:
    const char* m_TAG = TagHandler::SettingsFactory;
    PinMap* m_currentPinMap;
    bool m_restartRequired = false;
    bool m_initialized = false;
    // const int m_commonDeserializeSize = 32768;
    // const int m_commonSerializeSize = 24576;

    MotionProfile motionProfiles[MAX_MOTION_PROFILE_COUNT];
    ButtonSet buttonSets[MAX_BUTTON_SETS];

    SettingsChangeCallback message_callback = 0;

    SemaphoreHandle_t m_systemSemaphore;
    SemaphoreHandle_t m_networkSemaphore;
    SemaphoreHandle_t m_commonSemaphore;
    SemaphoreHandle_t m_pinSemaphore;
    SemaphoreHandle_t m_debugInfoSemaphore;

    SettingFileInfo m_systemFileInfo = 
    {
        false, SYSTEM_SETTINGS_PATH, SettingFile::System, JsonDocument(), [this] () {loadSystemCache();}, [this]() { loadSystemLiveCache(); },
        {
            {LOG_LEVEL_SETTING, "Log level", "The loglevel that will output", SettingType::Number, LOG_LEVEL_DEFAULT, RestartRequired::NO, {SettingProfile::System}},
            {DEVICE_TYPE, "Type of device", "The surrent selected device", SettingType::Number, DEVICE_TYPE_DEFAULT, RestartRequired::YES, {SettingProfile::System}},
            {MOTOR_TYPE_SETTING, "Motor type", "The current motor type", SettingType::Number, MOTOR_TYPE_DEFAULT, RestartRequired::YES, {SettingProfile::System}},
            {BOARD_TYPE_SETTING, "Board type", "The physical board type", SettingType::Number, BOARD_TYPE_DEFAULT, RestartRequired::YES, {SettingProfile::System}},
            {TCODE_VERSION_SETTING, "TCode version", "The version of TCode", SettingType::Number, TCODE_VERSION_DEFAULT, RestartRequired::YES, {SettingProfile::System}},
            {LOG_INCLUDETAGS, "Log included tags", "Log tags to be included in the output", SettingType::ArrayString, LOG_INCLUDETAGS_DEFAULT, RestartRequired::YES, {SettingProfile::System}},
            {LOG_EXCLUDETAGS, "Log excluded tags", "Log tags to be excluded in the output", SettingType::ArrayString, LOG_EXCLUDETAGS_DEFAULT, RestartRequired::YES, {SettingProfile::System}}
        }
    };

    SettingFileInfo m_networkFileInfo = 
    {
        false, NETWORK_SETTINGS_PATH, SettingFile::Network, JsonDocument(), [this] () {loadNetworkCache();}, [this] () {loadNetworkLiveCache();},
        {
            {SSID_SETTING, "Wifi ssid", "The ssid of the WiFi AP", SettingType::String, SSID_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi, SettingProfile::Wireless}},
            {WIFI_PASS_SETTING, "Wifi pass", "The password for the WiFi AP", SettingType::String, WIFI_PASS_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi, SettingProfile::Wireless}},
            {WIFI_BAND_SETTING, "Wifi band", "The band of the wifi", SettingType::Number, WIFI_BAND_SETTING_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi, SettingProfile::Wireless}},
            {STATICIP, "Static IP", "Enable static IP for this device", SettingType::Boolean, STATICIP_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {LOCALIP, "Local IP", "The static IP of this device", SettingType::String, LOCALIP_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {GATEWAY, "Gateway", "The networks gateway", SettingType::String, GATEWAY_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {SUBNET, "Subnet", "The networks subnet", SettingType::String, SUBNET_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {DNS1, "DNS1", "The networks first DNS", SettingType::String, DNS1_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {DNS2, "DSN2", "The networks second DNS", SettingType::String, DNS2_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {MDNS_ENABLED, "Mdns Enabled", "Enable the MDNS", SettingType::Boolean, MDNS_ENABLED_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {UDP_SERVER_PORT, "Udp port", "The UDP port for TCode input", SettingType::Number, UDP_SERVER_PORT_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {WEBSERVER_PORT, "Web port", "The Web port for the web server", SettingType::Number, WEBSERVER_PORT_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {HOST_NAME, "Hostname", "The hostname for network com", SettingType::String, HOST_NAME_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {FRIENDLY_NAME, "Friendly name", "The friendly name displayed when connecting", SettingType::String, FRIENDLY_NAME_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {AP_MODE_SSID, "AP Mode SSID", "The SSID for the Ap Mode/AD-HOC connection", SettingType::String, AP_MODE_SSID_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {AP_MODE_PASS, "AP Mode password", "The password for the Ap Mode/AD-HOC connection. Leave empty for disabled", SettingType::String, AP_MODE_PASS_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {AP_MODE_HIDDEN, "AP Mode hidden", "Does the AP mode broadcase its SSID or not.", SettingType::Boolean, AP_MODE_HIDDEN_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {AP_MODE_CHANNEL, "AP Mode channel", "The channel AP mode will work on.", SettingType::Number, AP_MODE_CHANNEL_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {AP_MODE_IP, "AP Mode IP", "The IP of AP mode.", SettingType::String, AP_MODE_IP_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {AP_MODE_SUBNET, "AP Mode subnet", "The subnet of AP mode.", SettingType::String, AP_MODE_SUBNET_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}},
            {AP_MODE_GATEWAY, "AP Mode gateway", "The Gateway of AP mode.", SettingType::String, AP_MODE_GATEWAY_DEFAULT, RestartRequired::YES, {SettingProfile::Wifi}}
            
