jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
#if BLUETOOTH_TCODE
            ,{BLUETOOTH_ENABLED, "Bluetooth classic enabled", "Bluetooth classic TCode. Note: this disabled wifi and the website. Use the setting command to switch back", SettingType::Boolean, BLUETOOTH_ENABLED_DEFAULT, RestartRequired::YES, {SettingProfile::Bluetooth, SettingProfile::Wireless}}
#endif             
#if BLE_TCODE
            ,{BLE_ENABLED, "BLE enabled", "BLE TCode. Note: this disabled wifi and the website. Use the setting command to switch back", SettingType::Boolean, BLE_ENABLED_DEFAULT, RestartRequired::YES, {SettingProfile::Ble, SettingProfile::Wireless}},
            {BLE_DEVICE_TYPE, "BLE device type", "BLE device type", SettingType::Number, BLE_DEVICE_TYPE_DEFAULT, RestartRequired::YES, {SettingProfile::Bluetooth, SettingProfile::Wireless}},
            {BLE_LOVE_DEVICE_TYPE, "BLE love device type", "BLE love device type", SettingType::Number, BLE_LOVE_DEVICE_TYPE_DEFAULT, RestartRequired::YES, {SettingProfile::Bluetooth, SettingProfile::Wireless}}    
#endif 
        }
    };

    SettingFileInfo m_commonFileInfo = 
    {
        false, COMMON_SETTINGS_PATH, SettingFile::Common, JsonDocument(), [this]() { loadCommonCache(); }, [this]() { loadCommonLiveCache(); },
        {
            {MAX_SERVO_RANGE, "Max servo range", "Max range of the servos", SettingType::Number, MAX_SERVO_RANGE_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {CONTINUOUS_TWIST, "Continous twist", "Ignores any feedback signal from a feedback servo", SettingType::Boolean, CONTINUOUS_TWIST_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {FEEDBACK_TWIST, "Feedback twist", "For feed back servos", SettingType::Boolean, FEEDBACK_TWIST_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {ANALOG_TWIST, "Analog twist", "Analog feedback servo", SettingType::Boolean, ANALOG_TWIST_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}}
#ifdef MOTOR_TYPE_BLDC
            ,{BLDC_TWIST_MULTIPLIER, "BLDC Twist multiplier", "BLDC Twist multiplier", SettingType::Float, BLDC_TWIST_MULTIPLIER_DEFAULT, RestartRequired::NO, {SettingProfile::Bldc}},
            {BLDC_RAILLENGTH, "Rail length", "SSR1 rail length", SettingType::Number, BLDC_RAILLENGTH_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_STROKELENGTH, "Stroke length", "SSR1 stroke length", SettingType::Number, BLDC_STROKELENGTH_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_PID_PROPORTIONAL_CONST, "PID proportional constant", "PID proportional const", SettingType::Float, BLDC_PID_PROPORTIONAL_CONST_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_LOWPASS_FILTER, "Low pass filter", "Low pass filter", SettingType::Float, BLDC_LOWPASS_FILTER_DEFAULT, RestartRequired::NO, {SettingProfile::Bldc}},
            {BLDC_TWIST_LIMIT, "Twist limit", "BLDC twist limit", SettingType::Float, BLDC_TWIST_LIMIT_DEFAULT, RestartRequired::NO, {SettingProfile::Bldc}},

            {BLDC_MOTORA_ENCODER, "BLDC encoder type", "Select the type of bldc encoder installed", SettingType::Number, BLDC_ENCODER_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_USEHALLSENSOR, "Use hall sensor", "Use Hall sensor for BLDC sensor", SettingType::Boolean, BLDC_USEHALLSENSOR_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_MOTORA_PULLEY_CIRCUMFERENCE, "Pull circumference", "The pulley circumference for BLDC motor", SettingType::Number, BLDC_MOTORA_PULLEY_CIRCUMFERENCE_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_MOTORA_VOLTAGE, "Motor voltage limit", "BLDC Motor voltage limit", SettingType::Float, BLDC_MOTORA_VOLTAGE_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_MOTORA_SUPPLY, "Motor Supply voltage", "BLDC Motor supply voltage", SettingType::Float, BLDC_MOTORA_SUPPLY_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_MOTORA_CURRENT, "Motor current", "BLDC Motor current", SettingType::Float, BLDC_MOTORA_CURRENT_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_MOTORA_ZEROELECANGLE, "Motor ZeroElecAngle", "BLDC Motor A ZeroElecAngle", SettingType::Float, BLDC_MOTORA_ZEROELECANGLE_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            
            {BLDC_MOTORB_ENCODER, "BLDC left encoder type", "Select the type of Left bldc encoder installed", SettingType::Number, BLDC_ENCODER_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_MOTORB_PULLEY_CIRCUMFERENCE, "Pull left circumference", "The pulley circumference for Left BLDC motor", SettingType::Number, BLDC_MOTORB_PULLEY_CIRCUMFERENCE_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_MOTORB_VOLTAGE, "Left Motor voltage limit", "BLDC Left Motor voltage limit", SettingType::Float, BLDC_MOTORB_VOLTAGE_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_MOTORB_SUPPLY, "Left Motor Supply voltage", "BLDC Left Motor supply voltage", SettingType::Float, BLDC_MOTORB_SUPPLY_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_MOTORB_CURRENT, "Left Motor current", "BLDC Left Motor current", SettingType::Float, BLDC_MOTORB_CURRENT_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}},
            {BLDC_MOTORB_ZEROELECANGLE, "Left Motor ZeroElecAngle", "Left BLDC Motor ZeroElecAngle", SettingType::Float, BLDC_MOTORB_ZEROELECANGLE_DEFAULT, RestartRequired::YES, {SettingProfile::Bldc}}
            
#elif defined MOTOR_TYPE_SERVO
            ,{RIGHT_SERVO_ZERO, "Right servo zero", "The zero calibration for the right servo", SettingType::Number, RIGHT_SERVO_ZERO_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {LEFT_SERVO_ZERO, "Left servo zero", "The zero calibration for the left servo", SettingType::Number, LEFT_SERVO_ZERO_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {RIGHT_UPPER_SERVO_ZERO, "Right upper servo zero", "The zero calibration for the right upper servo", SettingType::Number, RIGHT_UPPER_SERVO_ZERO_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {LEFT_UPPER_SERVO_ZERO, "Left upper servo zero", "The zero calibration for the left upper servo", SettingType::Number, LEFT_UPPER_SERVO_ZERO_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {PITCH_LEFT_SERVO_ZERO, "Pitch left servo zero", "The zero calibration for the pitch left servo", SettingType::Number, PITCH_LEFT_SERVO_ZERO_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {PITCH_RIGHT_SERVO_ZERO, "Pitch right servo zero", "The zero calibration for the pitch right servo", SettingType::Number, PITCH_RIGHT_SERVO_ZERO_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}}
#endif
            ,{TWIST_SERVO_ZERO, "Twist servo zero", "The zero calibration for the twist servo", SettingType::Number, TWIST_SERVO_ZERO_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {VALVE_SERVO_ZERO, "Valve servo zero", "The zero calibration for the valve servo", SettingType::Number, VALVE_SERVO_ZERO_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {SQUEEZE_ZERO, "Squeeze servo zero", "The zero calibration for the squeeze servo", SettingType::Number, SQUEEZE_ZERO_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {AUTO_VALVE, "Auto valve", "Enable valve auto behavior", SettingType::Boolean, AUTO_VALVE_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {INVERSE_VALVE, "Inverse valve", "Inverse the valve movement", SettingType::Boolean, INVERSE_VALVE_DEFAULT, RestartRequired::NO, {SettingProfile::Servo}},
            {VALVE_SERVO_90DEGREES, "Valve 90 degree servo", "The valve is 90 degrees max", SettingType::Boolean, VALVE_SERVO_90DEGREES_DEFAULT, RestartRequired::YES, {SettingProfile::Servo}},
            {INVERSE_STROKE, "Inverse stroke", "Inverse stroke", SettingType::Boolean, INVERSE_STROKE_DEFAULT, RestartRequired::NO, {SettingProfile::Servo}},
            {INVERSE_PITCH, "Inverse pitch", "Inverse pitch", SettingType::Boolean, INVERSE_PITCH_DEFAULT, RestartRequired::NO, {SettingProfile::Servo}},
            {INVERSE_TWIST, "Inverse twist", "Inverse twist", SettingType::Boolean, INVERSE_TWIST_DEFAULT, RestartRequired::NO, {SettingProfile::Servo}},
            {LUBE_AMOUNT, "Lube amount", "Amount of lube in PWM", SettingType::Number, LUBE_AMOUNT_DEFAULT, RestartRequired::YES, {SettingProfile::System}},
            {LUBE_ENABLED, "Lube enabled", "Enable lube", SettingType::Boolean, LUBE_ENABLED_DEFAULT, RestartRequired::YES, {SettingProfile::System}},
            {VIB_TIMEOUT_ENABLED, "Vib timeout Enabled", "If disabled the vibs must be manually stopped", SettingType::Boolean, VIB_TIMEOUT_ENABLED_DEFAULT, RestartRequired::NO, {SettingProfile::Vib}},
            {VIB_TIMEOUT, "Vib timeout", "The time out the vib stops", SettingType::Number, VIB_TIMEOUT_DEFAULT, RestartRequired::NO, {SettingProfile::Vib}},
            {DISPLAY_ENABLED, "Display enabled", "Enable the OLED display", SettingType::Boolean, DISPLAY_ENABLED_DEFAULT, RestartRequired::YES, {SettingProfile::Display}},
            {SLEEVE_TEMP_DISPLAYED, "Sleeve temp displayed", "Display the sleeve temp on the OLED", SettingType::Boolean, SLEEVE_TEMP_DISPLAYED_DEFAULT, RestartRequired::YES, {SettingProfile::Display}},
            {VERSION_DISPLAYED, "Version displayed", "Display the version on the OLED", SettingType::Boolean, VERSION_DISPLAYED_DEFAULT, RestartRequired::YES, {SettingProfile::Display}},
            {INTERNAL_TEMP_DISPLAYED, "Internal temp displayed", "Display the internal temp on the OLED", SettingType::Boolean, INTERNAL_TEMP_DISPLAYED_DEFAULT, RestartRequired::YES, {SettingProfile::Display}},
            {TEMP_SLEEVE_ENABLED, "Temp sleeve enabled", "Enable sleeve temp", SettingType::Boolean, TEMP_SLEEVE_ENABLED_DEFAULT, RestartRequired::YES, {SettingProfile::Temperature}},
            {DISPLAY_SCREEN_WIDTH, "Display screen width", "Screen width of the OLED", SettingType::Number, DISPLAY_SCREEN_WIDTH_DEFAULT, RestartRequired::YES, {SettingProfile::Display}},
            {DISPLAY_SCREEN_HEIGHT, "Display screen height", "Screen height of the OLED", SettingType::Number, DISPLAY_SCREEN_HEIGHT_DEFAULT, RestartRequired::YES, {SettingProfile::Display}},
            {TARGET_TEMP, "Target sleeve temp", "Target temp for the sleeve", SettingType::Float, TARGET_TEMP_DEFAULT, RestartRequired::YES, {SettingProfile::Temperature}},
            {HEAT_PWM, "Heat PWM", "PWM when the sleeve needs heating", SettingType::Number, HEAT_PWM_DEFAULT, RestartRequired::YES, {SettingProfile::Temperature}},
            {HOLD_PWM, "Hold PWM", "PWM when the sleeve is at target", SettingType::Number, HOLD_PWM_DEFAULT, RestartRequired::YES, {SettingProfile::Temperature}},
            {CASE_FAN_MAX_PWM, "Max Fan PWM", "PWM when the fan is at its max speed", SettingType::Number, CASE_FAN_MAX_PWM_DEFAULT, RestartRequired::YES, {SettingProfile::Temperature}},
            {DISPLAY_I2C_ADDRESS, "Display I2C address", "I2C address of the display", SettingType::String, DISPLAY_I2C_ADDRESS_DEFAULT, RestartRequired::YES, {SettingProfile::Display}},
            {SERVO_RESOLUTION, "Servo resolution", "Resolution for the servo PWM", SettingType::Number, SERVO_RESOLUTION_DEFAULT, RestartRequired::YES, {SettingProfile::PWM, SettingProfile::Servo}},
            {VIBE_RESOLUTION, "Vibe resolution", "Resolution for the vibe PWM", SettingType::Number, VIBE_RESOLUTION_DEFAULT, RestartRequired::YES, {SettingProfile::PWM}},
            {LUBE_RESOLUTION, "Lube resolution", "Resolution for the lube PWM", SettingType::Number, LUBE_RESOLUTION_DEFAULT, RestartRequired::YES, {SettingProfile::PWM}},
            {HEATER_THRESHOLD, "Heater thresh hold", "The HoldPWM will be sent while the temp less than or equal to TargetTemp + heaterThreshold", SettingType::Float, HEATER_THRESHOLD_DEFAULT, RestartRequired::YES, {SettingProfile::Temperature}},// TODo: what is this exactly
            {HEATER_RESOLUTION, "Heater resolution", "Resolution for the Heater PWM", SettingType::Number, HEATER_RESOLUTION_DEFAULT, RestartRequired::YES, {SettingProfile::Temperature}},
            {FAN_CONTROL_ENABLED, "Fan control enabled", "Enable PWM fan", SettingType::Boolean, FAN_CONTROL_ENABLED_DEFAULT, RestartRequired::YES, {SettingProfile::Temperature}},
            {CASE_FAN_RESOLUTION, "Fan resolution", "Fan resolution", SettingType::Number, CASE_FAN_RESOLUTION_DEFAULT, RestartRequired::YES, {SettingProfile::Temperature}},
            {INTERNAL_TEMP_FOR_FANON, "Internal temp for fan", "The temp. threshold to turn the fan on", SettingType::Double, INTERNAL_TEMP_FOR_FAN_DEFAULT, RestartRequired::YES, {SettingProfile::Temperature}},
            {INTERNAL_MAX_TEMP, "Internal max temp", "Max temp for internal. The movement will shutdown if this value is reached.", SettingType::Double, INTERNAL_MAX_TEMP_DEFAULT, RestartRequired::YES, {SettingProfile::Temperature}},
            {TEMP_INTERNAL_ENABLED, "Temp Internal enabled", "Enable the internal temp sensor", SettingType::Boolean, TEMP_INTERNAL_ENABLED_DEFAULT, RestartRequired::YES, {SettingProfile::Temperature}},
            {BATTERY_LEVEL_ENABLED, "Battery level enabled", "Enable the battery level", SettingType::Boolean, BATTERY_LEVEL_ENABLED_DEFAULT, RestartRequired::YES, {SettingProfile::Battery}},
            {BATTERY_LEVEL_NUMERIC, "Battery level numeric", "Display the battery level in numeric form", SettingType::Boolean, BATTERY_LEVEL_NUMERIC_DEFAULT, RestartRequired::YES, {SettingProfile::Battery}},
            {BATTERY_VOLTAGE_MAX, "Battery voltage max", "The max voltage for the battery", SettingType::Double, BATTERY_VOLTAGE_MAX_DEFAULT, RestartRequired::YES, {SettingProfile::Battery}},
            {BATTERY_CAPACITY_MAX, "Battery capcity max", "The battery max capacity", SettingType::Number, BATTERY_CAPACITY_MAX_DEFAULT, RestartRequired::YES, {SettingProfile::Battery}},
            {VOICE_ENABLED, "Voice enabled", "Enable voice control", SettingType::Boolean, VOICE_ENABLED_DEFAULT, RestartRequired::YES, {SettingProfile::Voice}},
            {VOICE_MUTED, "Voice muted", "Voice talk back muted", SettingType::Boolean, VOICE_MUTED_DEFAULT, RestartRequired::YES, {SettingProfile::Voice}},
            {VOICE_WAKE_TIME, "Voice wake time", "How long to keep the voice module awake listening for commands", SettingType::Number, VOICE_WAKE_TIME_DEFAULT, RestartRequired::YES, {SettingProfile::Voice}},
            {VOICE_VOLUME, "Voice volume", "The volume of the voice talk back", SettingType::Number, VOICE_VOLUME_DEFAULT, RestartRequired::YES, {SettingProfile::Voice}},
            {BOOT_BUTTON_ENABLED, "Boot button enabled", "Enables the boot button function", SettingType::Boolean, BOOT_BUTTON_ENABLED_DEFAULT, RestartRequired::YES, {SettingProfile::Button}},
            {BOOT_BUTTON_COMMAND, "Boot button command", "Command to execute when the boot button is pressed", SettingType::String, BOOT_BUTTON_COMMAND_DEFAULT, RestartRequired::NO, {SettingProfile::Button}},
            {BUTTON_SETS_ENABLED, "Button sets enabled", "Enables the button sets function", SettingType::Boolean, BUTTON_SETS_ENABLED_DEFAULT, RestartRequired::YES, {SettingProfile::Button}},
            {BUTTON_ANALOG_DEBOUNCE, "Button debounce", "How long to debounce the button press in ms", SettingType::Number, BUTTON_ANALOG_DEBOUNCE_DEFAULT, RestartRequired::NO, {SettingProfile::Button}}
        }
    };

