jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
    void checkRestartRequired(const Setting* setting, const char* settingName)
    {
        // if(setting && m_initialized && !m_restartRequired )
        // {
        //     m_restartRequired = setting->isRestartRequired == RestartRequired::YES;
        // }
    }

    bool load(SettingFileInfo &fileInfo)
    {
        LogHandler::info(m_TAG, "Loading file: %s", fileInfo.path);
        bool fileExists = LittleFS.exists(fileInfo.path);
        if(!fileExists)
        {
            LogHandler::info(m_TAG, "File %s did not exist", fileInfo.path);
            if(!createJsonFile(fileInfo.path))
                return false;
            if(!loadDefault(fileInfo.file))
                return false;
        } else {
            File file = LittleFS.open(fileInfo.path, FILE_READ, !fileExists);
            if(!file) {
                LogHandler::error(m_TAG, "%s failed to open!", fileInfo.path);
                return false;
            }
            if(LogDeserializationError(deserializeJson(fileInfo.doc, file), file.name())) {
                file.close();
                createJsonFile(fileInfo.path);
                return false;
            }
            file.close();
            fileInfo.initialized = true;
            if(fileInfo.onload)
                fileInfo.onload();
        }
        //json = doc.as<JsonObject>();
        return true;
    }
    
    // bool loadVector(SettingFileInfo &fileInfo, std::vector<const char*> vector)
    // {
    //     for (size_t i = 0; i < fileInfo.settings.size(); i++)
    //     {
    //         Setting setting = fileInfo.settings[i];
    //         if(setting.type == SettingType::ArrayString) 
    //         {
    //             JsonArray array = fileInfo.doc[setting.name];
    //             for (size_t j = 0; j < array.size(); j++)
    //             {
    //                 vector.push_back(array[j].as<const char*>());
    //             }
                
    //         } 
    //     }
        
    //     return true;
    // }

    bool loadDefault(SettingFile file) 
    {
        if(file == SettingFile::System) 
        {
            return loadDefault(m_systemFileInfo);
        }
        else if(file == SettingFile::Network) 
        {
            return loadDefault(m_networkFileInfo);
        }
        else if(file == SettingFile::Common) 
        {
            return loadDefault(m_commonFileInfo);
        }
        else if(file == SettingFile::Pins) 
        {
            return loadDefaultPins();
        }
        else if(file == SettingFile::DebugInfo) 
        {
            SettingFileInfo debugInfo = getDebugInfo();
            return loadDefault(debugInfo);
            
        }
        LogHandler::error(m_TAG, "Unknown file loading default: %ld", (int)file);
        return false;
    }

    //template <unsigned int N>
    bool loadDefault(SettingFileInfo &fileInfo)
    {
        LogHandler::info(m_TAG, "Loading default: %s", fileInfo.path);
        for(const Setting& setting : fileInfo.settings)
        {
            defaultToJson(&setting, fileInfo.doc);
        }
        fileInfo.initialized = true;
        return saveToDisk(fileInfo);
    }

    bool loadDefaultVector(const Setting *setting, JsonDocument &doc) {
        
        if(!strcmp(setting->name, LOG_INCLUDETAGS)) {
            std::vector<const char*> includesVec;
            doc[LOG_INCLUDETAGS] = includesVec;
            loadSystemLiveCache(LOG_INCLUDETAGS);
            return true;
        } else if(!strcmp(setting->name, LOG_EXCLUDETAGS)) {
            std::vector<const char*> excludesVec;
            doc[LOG_EXCLUDETAGS] = excludesVec;
            loadSystemLiveCache(LOG_EXCLUDETAGS);
            return true;
        } else if(!strcmp(setting->name, BUTTON_SET_PINS)) {
            std::vector<int8_t> vec = { BUTTON_SET_PINS_1, BUTTON_SET_PINS_2, BUTTON_SET_PINS_3, BUTTON_SET_PINS_4 };
            doc[BUTTON_SET_PINS] = vec;
            return true;
        } else if(!strcmp(setting->name, DEBUG_INFO_LAST_BOOT_REASONS)) {
            std::vector<const char*> vec = { };
            doc[DEBUG_INFO_LAST_BOOT_REASONS] = vec;
            return true;
        }
        LogHandler::error(m_TAG, "No default vector set for: %s", setting->name);
        return false;
    }

    bool loadDefaultPins() {
        BoardType boardType;
        getValue(BOARD_TYPE_SETTING, boardType);// Use setting from json
        switch(boardType)
        {
            case BoardType::CRIMZZON: {
                PinMapSR6MB* pinMap = PinMapSR6MB::getInstance();
                pinMap->overideDefaults();
                m_pinsFileInfo.initialized = true;
                syncSR6AndCommonPinsToDisk(pinMap);
                loadDefaultChannelsForDeviceType();
                return saveToDisk(m_pinsFileInfo);
            }
            break;
            case BoardType::ISAAC: {
                PinMapINControl* pinMap = PinMapINControl::getInstance();
                pinMap->overideDefaults();
                m_pinsFileInfo.initialized = true;
                syncSR6AndCommonPinsToDisk(pinMap);
                loadDefaultChannelsForDeviceType();
                return saveToDisk(m_pinsFileInfo);
            }
            break;
            case BoardType::SSR1PCB: {
                PinMapSSR1PCB* pinMap = PinMapSSR1PCB::getInstance();
                pinMap->overideDefaults();
                m_pinsFileInfo.initialized = true;
                syncSSRAndCommonPinsToDisk(pinMap);
                loadDefaultChannelsForDeviceType();
                return saveToDisk(m_pinsFileInfo);
            }
            break;
            default: {
                bool ret = loadDefault(m_pinsFileInfo);
                m_pinsFileInfo.initialized = true;
                loadDefaultChannelsForDeviceType();
                return saveToDisk(m_pinsFileInfo);
            }
        }
    }

    void loadDefaultChannelsForDeviceType() {
        DeviceType deviceType;
        getValue(DEVICE_TYPE, deviceType);
        switch(deviceType) {
            case DeviceType::OSR: {
                LogHandler::debug(m_TAG, "Loading default channels and pins for OSR");
#if CONFIG_IDF_TARGET_ESP32
                setValue(RIGHT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH0_CH0);
                setValue(LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH0_CH1);
                setValue(RIGHT_UPPER_SERVO_PIN, -1);
                setValue(RIGHT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_UPPER_SERVO_PIN, -1);
                setValue(LEFT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(PITCH_LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH1_CH2);
                setValue(PITCH_RIGHTSERVO_PIN, -1);
                setValue(PITCH_RIGHTSERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(TWIST_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH1_CH3);
                setValue(VALVE_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH2_CH4);
                setValue(SQUEEZE_PIN, -1);
                setValue(SQUEEZE_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE0_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH0);
                setValue(VIBE1_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH1);
                setValue(VIBE2_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH2);
                setValue(VIBE3_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH3);
                setValue(ESP_L_TIMER0_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(ESP_L_TIMER1_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(CASE_FAN_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH4);
                setValue(HEATER_CHANNEL, (int8_t)ESPTimerChannelNum::LOW3_CH6);
#elif CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32E22
                setValue(RIGHT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH0);
                setValue(LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH1);
                setValue(RIGHT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_UPPER_SERVO_PIN, -1);
                setValue(LEFT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(PITCH_LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH2);
                setValue(PITCH_RIGHTSERVO_PIN, -1);
                setValue(PITCH_RIGHTSERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(TWIST_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH3);
                setValue(VALVE_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH5);
                setValue(SQUEEZE_PIN, -1);
                setValue(SQUEEZE_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE0_PIN, -1);
                setValue(VIBE0_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE1_PIN, -1);
                setValue(VIBE1_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE2_PIN, -1);
                setValue(VIBE2_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE3_PIN, -1);
                setValue(VIBE3_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(CASE_FAN_PIN, -1);
                setValue(CASE_FAN_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(HEATER_PIN, -1);
                setValue(HEATER_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
#endif
                break;
            }
            case DeviceType::SR6: {
                LogHandler::debug(m_TAG, "Loading default channels and pins for SR6");
#if CONFIG_IDF_TARGET_ESP32
                setValue(RIGHT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH0_CH0);
                setValue(LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH0_CH1);
                setValue(RIGHT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH1_CH2);
                setValue(LEFT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH1_CH3);
                setValue(PITCH_LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH2_CH4);
                setValue(PITCH_RIGHTSERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH2_CH5);
                setValue(TWIST_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH3_CH6);
                setValue(VALVE_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH3_CH7);
                setValue(SQUEEZE_PIN, -1);
                setValue(SQUEEZE_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE0_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH0);
                setValue(VIBE1_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH1);
                setValue(VIBE2_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH2);
                setValue(VIBE3_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH3);
                setValue(ESP_L_TIMER0_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(ESP_L_TIMER1_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(CASE_FAN_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH4);
                setValue(HEATER_CHANNEL, (int8_t)ESPTimerChannelNum::LOW3_CH6);
#elif CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32E22
                setValue(RIGHT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH0);
                setValue(LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH1);
                setValue(RIGHT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH2);
                setValue(LEFT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH3);
                setValue(PITCH_LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH4);
                setValue(PITCH_RIGHTSERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH5);
                setValue(TWIST_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW3_CH6);
                setValue(VALVE_SERVO_PIN, -1);
                setValue(VALVE_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(SQUEEZE_PIN, -1);
                setValue(SQUEEZE_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE0_PIN, -1);
                setValue(VIBE0_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE1_PIN, -1);
                setValue(VIBE1_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE2_PIN, -1);
                setValue(VIBE2_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE3_PIN, -1);
                setValue(VIBE3_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(CASE_FAN_CHANNEL, (int8_t)ESPTimerChannelNum::LOW3_CH7);
                setValue(HEATER_PIN, -1);
                setValue(HEATER_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
#endif
                break;
            }
            case DeviceType::SSR1:
            case DeviceType::SSR2: {
                LogHandler::debug(m_TAG, "Loading default channels and pins for SSR1");
#if CONFIG_IDF_TARGET_ESP32
                setValue(RIGHT_SERVO_PIN, -1);
                setValue(RIGHT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_SERVO_PIN, -1);
                setValue(LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(RIGHT_UPPER_SERVO_PIN, -1);
                setValue(RIGHT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_UPPER_SERVO_PIN, -1);
                setValue(LEFT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(PITCH_LEFT_SERVO_PIN, -1);
                setValue(PITCH_LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(TWIST_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH0_CH0);
                setValue(VALVE_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH2_CH4);
                setValue(PITCH_RIGHTSERVO_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH0_CH1);
                setValue(SQUEEZE_CHANNEL, (int8_t)ESPTimerChannelNum::HIGH1_CH2);
                setValue(VIBE0_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH0);
                setValue(VIBE1_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH1);
                setValue(VIBE2_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH2);
                setValue(VIBE3_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH3);
                setValue(ESP_L_TIMER0_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(ESP_L_TIMER1_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(CASE_FAN_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH4);
                setValue(HEATER_CHANNEL, (int8_t)ESPTimerChannelNum::LOW3_CH6);
#elif CONFIG_IDF_TARGET_ESP32S3 || CONFIG_IDF_TARGET_ESP32C5 || CONFIG_IDF_TARGET_ESP32C6 || CONFIG_IDF_TARGET_ESP32E22
                setValue(RIGHT_SERVO_PIN, -1);
                setValue(RIGHT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_SERVO_PIN, -1);
                setValue(LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(RIGHT_UPPER_SERVO_PIN, -1);
                setValue(RIGHT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_UPPER_SERVO_PIN, -1);
                setValue(LEFT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(PITCH_LEFT_SERVO_PIN, -1);
                setValue(PITCH_LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(TWIST_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH0);
                setValue(VALVE_SERVO_PIN, -1);
                setValue(VALVE_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(PITCH_RIGHTSERVO_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH1);
                setValue(SQUEEZE_PIN, -1);
                setValue(SQUEEZE_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE0_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH2);
                setValue(VIBE1_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH3);
                setValue(VIBE2_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH4);
                setValue(VIBE3_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH5);
                setValue(ESP_L_TIMER1_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(ESP_L_TIMER2_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(CASE_FAN_CHANNEL, (int8_t)ESPTimerChannelNum::LOW3_CH6);
                setValue(HEATER_CHANNEL, (int8_t)ESPTimerChannelNum::LOW3_CH7);
#endif
                break;
            }
            case DeviceType::TVIBE: {
                LogHandler::debug(m_TAG, "Loading default channels and pins for TVIBE");
                setValue(RIGHT_SERVO_PIN, -1);
                setValue(RIGHT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_SERVO_PIN, -1);
                setValue(LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(RIGHT_UPPER_SERVO_PIN, -1);
                setValue(RIGHT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(LEFT_UPPER_SERVO_PIN, -1);
                setValue(LEFT_UPPER_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(PITCH_LEFT_SERVO_PIN, -1);
                setValue(PITCH_LEFT_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(TWIST_SERVO_PIN, -1);
                setValue(TWIST_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VALVE_SERVO_PIN, -1);
                setValue(VALVE_SERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(PITCH_RIGHTSERVO_PIN, -1);
                setValue(PITCH_RIGHTSERVO_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(SQUEEZE_PIN, -1);
                setValue(SQUEEZE_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
                setValue(VIBE0_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH0);
                setValue(VIBE1_CHANNEL, (int8_t)ESPTimerChannelNum::LOW0_CH1);
                setValue(VIBE2_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH2);
                setValue(VIBE3_CHANNEL, (int8_t)ESPTimerChannelNum::LOW1_CH3);
                setValue(ESP_L_TIMER0_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(ESP_L_TIMER1_FREQUENCY, ESP_VIB_TIMER_FREQUENCY_DEFAULT);
                setValue(CASE_FAN_CHANNEL, (int8_t)ESPTimerChannelNum::LOW2_CH4);
                setValue(HEATER_PIN, -1);
                setValue(HEATER_CHANNEL, (int8_t)ESPTimerChannelNum::NONE);
            }
        }
    }
            
    bool loadAllFromDisk()
    {
        for(SettingFileInfo* settingsInfo : AllSettings)
        {
            if(!load(*settingsInfo))
                return false;
        }
        return true;
    }

    bool loadSystemFromDisk()
    {
        xSemaphoreTake(m_systemSemaphore, portTICK_PERIOD_MS);
        auto ret = load(m_systemFileInfo);
        xSemaphoreGive(m_systemSemaphore);
        return ret;
    }

    bool loadCommonFromDisk()
    {
        xSemaphoreTake(m_commonSemaphore, portTICK_PERIOD_MS);
        auto ret = load(m_commonFileInfo);
        xSemaphoreGive(m_commonSemaphore);
        return ret;
    }
    bool loadNetworkFromDisk()
    {
        xSemaphoreTake(m_networkSemaphore, portTICK_PERIOD_MS);
        bool ret = load(m_networkFileInfo);;
        xSemaphoreGive(m_networkSemaphore);
        return ret;
    }
    bool loadPinsFromDisk()
    {
        xSemaphoreTake(m_pinSemaphore, portTICK_PERIOD_MS);
        bool ret = load(m_pinsFileInfo);
        xSemaphoreGive(m_pinSemaphore);
        return ret;
    }

    //template <unsigned int N>
    bool saveToDisk(SettingFileInfo &fileInfo, JsonObject fromJson = JsonObject())
    {
        LogHandler::info(m_TAG, "Save file: %s", fileInfo.path);
        if(!fromJson.isNull()) {
            LogHandler::debug(m_TAG, "Saving from override json");
            fileInfo.doc.clear();
            fileInfo.doc.set(fromJson);
        }

        LogHandler::debug(m_TAG, "Doc overflowed: %u", fileInfo.doc.overflowed());
        //LogHandler::debug(m_TAG, "Doc memory: %u", fileInfo.doc.memoryUsage());
        //LogHandler::debug(m_TAG, "Doc capacity: %u", fileInfo.doc.capacity());
        File file = LittleFS.open(fileInfo.path, FILE_WRITE);
        if (!file )
        {
            LogHandler::error(m_TAG, "Failed to open file: %s", fileInfo.path);
            return false;
        }
        if (!serializeJson(fileInfo.doc, file))
        {
            LogHandler::error(m_TAG, "Failed to write to file: %s", fileInfo.path);
            file.close();
            return false;
        }
        if(LogHandler::getLogLevel() >= LogLevel::DEBUG)
            LogHandler::debug(m_TAG, "File contents: %s", file.readString().c_str());
        file.close();
        if(fileInfo.onchange)
            fileInfo.onchange();
        return true;
    }
    
