jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
    }

    PinMapOSR* loadOSRPins() 
    {
        if(!m_pinsFileInfo.initialized) {
            LogHandler::error(m_TAG, "loadSSR1Pins called before initialized");
            return 0;
        }
        PinMapOSR* pinMap = PinMapOSR::getInstance();
        loadCommonPins(pinMap);
        int8_t pin = -1;
        int8_t channel = -1;
        getValue(RIGHT_SERVO_PIN, pin);
        pinMap->setRightServo(pin);
        getValue(RIGHT_SERVO_CHANNEL, channel);
        pinMap->setRightServoChannel(channel);
        getValue(LEFT_SERVO_PIN, pin);
        pinMap->setLeftServo(pin);
        getValue(LEFT_SERVO_CHANNEL, channel);
        pinMap->setLeftServoChannel(channel);
        getValue(PITCH_LEFT_SERVO_PIN, pin);
        pinMap->setPitchLeft(pin);
        getValue(PITCH_LEFT_SERVO_CHANNEL, channel);
        pinMap->setPitchLeftChannel(channel);
        return pinMap;
    }
    
    PinMapSR6* loadSR6Pins() 
    {
        if(!m_pinsFileInfo.initialized) {
            LogHandler::error(m_TAG, "loadSR6Pins called before initialized");
            return 0;
        }
        PinMapSR6* pinMap = PinMapSR6::getInstance();
        loadCommonPins(pinMap);
        int8_t pin = -1;
        int8_t channel = -1;
        getValue(RIGHT_SERVO_PIN, pin);
        pinMap->setRightServo(pin);
        getValue(RIGHT_SERVO_CHANNEL, channel);
        pinMap->setRightServoChannel(channel);
        getValue(LEFT_SERVO_PIN, pin);
        pinMap->setLeftServo(pin);
        getValue(LEFT_SERVO_CHANNEL, channel);
        pinMap->setLeftServoChannel(channel);
        getValue(PITCH_LEFT_SERVO_PIN, pin);
        pinMap->setPitchLeft(pin);
        getValue(PITCH_LEFT_SERVO_CHANNEL, channel);
        pinMap->setPitchLeftChannel(channel);
        getValue(PITCH_RIGHTSERVO_PIN, pin);
        pinMap->setPitchRight(pin);
        getValue(PITCH_RIGHTSERVO_CHANNEL, channel);
        pinMap->setPitchRightChannel(channel);
        getValue(RIGHT_UPPER_SERVO_PIN, pin);
        pinMap->setRightUpperServo(pin);
        getValue(RIGHT_UPPER_SERVO_CHANNEL, channel);
        pinMap->setRightUpperServoChannel(channel);
        getValue(LEFT_UPPER_SERVO_PIN, pin);
        pinMap->setLeftUpperServo(pin);
        getValue(LEFT_UPPER_SERVO_CHANNEL, channel);
        pinMap->setLeftUpperServoChannel(channel);
        return pinMap;
    }
    
    void syncCommonPinsToDoc(const PinMap* pinMap) 
    {
        if(!m_pinsFileInfo.initialized) {
            LogHandler::error(m_TAG, "syncCommonPinsToDoc called before initialized");
            return;
        }
        setValue(VALVE_SERVO_PIN, pinMap->valve());
        setValue(VALVE_SERVO_CHANNEL, pinMap->valveChannel());
        setValue(TWIST_SERVO_PIN, pinMap->twist());
        setValue(TWIST_SERVO_CHANNEL, pinMap->twistChannel());
        setValue(SQUEEZE_PIN, pinMap->squeeze());
        setValue(SQUEEZE_CHANNEL, pinMap->squeezeChannel());
        setValue(VIBE0_PIN, pinMap->vibe0());
        setValue(VIBE0_CHANNEL, pinMap->vibe0Channel());
        setValue(VIBE1_PIN, pinMap->vibe1());
        setValue(VIBE1_CHANNEL, pinMap->vibe1Channel());
        setValue(VIBE2_PIN, pinMap->vibe2());
        setValue(VIBE2_CHANNEL, pinMap->vibe2Channel());
        setValue(VIBE3_PIN, pinMap->vibe3());
        setValue(VIBE3_CHANNEL, pinMap->vibe3Channel());
        setValue(CASE_FAN_PIN, pinMap->caseFan());
        setValue(CASE_FAN_CHANNEL, pinMap->caseFanChannel());
        setValue(HEATER_PIN, pinMap->heater());
        setValue(HEATER_CHANNEL, pinMap->heaterChannel());

        setValue(TWIST_FEEDBACK_PIN, pinMap->twistFeedBack());
        setValue(LUBE_BUTTON_PIN, pinMap->lubeButton());
        setValue(INTERNAL_TEMP_PIN, pinMap->internalTemp());
        setValue(DISPLAY_RST_PIN, pinMap->displayReset());
        setValue(TEMP_PIN, pinMap->sleeveTemp());
        setValue(I2C_SDA_PIN, pinMap->i2cSda());
        setValue(I2C_SCL_PIN, pinMap->i2cScl());
#if CONFIG_IDF_TARGET_ESP32
        setValue(ESP_H_TIMER0_FREQUENCY, pinMap->getTimerFrequency(0));
        setValue(ESP_H_TIMER1_FREQUENCY, pinMap->getTimerFrequency(1));
        setValue(ESP_H_TIMER2_FREQUENCY, pinMap->getTimerFrequency(2));
        setValue(ESP_H_TIMER3_FREQUENCY, pinMap->getTimerFrequency(3));
        setValue(ESP_L_TIMER0_FREQUENCY, pinMap->getTimerFrequency(4));
        setValue(ESP_L_TIMER1_FREQUENCY, pinMap->getTimerFrequency(5));
        setValue(ESP_L_TIMER2_FREQUENCY, pinMap->getTimerFrequency(6));
        setValue(ESP_L_TIMER3_FREQUENCY, pinMap->getTimerFrequency(7));
#else
        setValue(ESP_L_TIMER0_FREQUENCY, pinMap->getTimerFrequency(0));
        setValue(ESP_L_TIMER1_FREQUENCY, pinMap->getTimerFrequency(1));
        setValue(ESP_L_TIMER2_FREQUENCY, pinMap->getTimerFrequency(2));
        setValue(ESP_L_TIMER3_FREQUENCY, pinMap->getTimerFrequency(3));
#endif
    }

    void syncSSRAndCommonPinsToDisk(const PinMapSSR* pinMap) 
    {
        if(!m_pinsFileInfo.initialized) {
            LogHandler::error(m_TAG, "syncSSRAndCommonPinsToDisk called before initialized");
            return;
        }
        syncCommonPinsToDoc(pinMap);
        setValue(BLDC_ENCODER_PIN, pinMap->encoder());
        setValue(BLDC_CHIPSELECT_PIN, pinMap->chipSelect());
        setValue(BLDC_ENABLE_PIN, pinMap->enable());
        setValue(BLDC_HALLEFFECT_PIN, pinMap->hallEffect());
        setValue(BLDC_PWMCHANNEL1_PIN, pinMap->pwmChannel1());
        setValue(BLDC_PWMCHANNEL2_PIN, pinMap->pwmChannel2());
        setValue(BLDC_PWMCHANNEL3_PIN, pinMap->pwmChannel3());
        setValue(BLDC_B_ENCODER_PIN, pinMap->motorBEncoder());
        setValue(BLDC_B_CHIPSELECT_PIN, pinMap->motorBChipSelect());
        setValue(BLDC_B_ENABLE_PIN, pinMap->motorBEnable());
        setValue(BLDC_B_PWMCHANNEL1_PIN, pinMap->motorBPwmChannel1());
        setValue(BLDC_B_PWMCHANNEL2_PIN, pinMap->motorBPwmChannel2());
        setValue(BLDC_B_PWMCHANNEL3_PIN, pinMap->motorBPwmChannel3());
        savePins();
    }

    void syncOSRAndCommonPinsToDisk(const PinMapOSR* pinMap) 
    {
        if(!m_pinsFileInfo.initialized) {
            LogHandler::error(m_TAG, "syncOSRAndCommonPinsToDisk called before initialized");
            return;
        }
        syncCommonPinsToDoc(pinMap);
        setValue(RIGHT_SERVO_PIN, pinMap->rightServo());
        setValue(RIGHT_SERVO_CHANNEL, pinMap->rightServoChannel());
        setValue(LEFT_SERVO_PIN, pinMap->leftServo());
        setValue(LEFT_SERVO_CHANNEL, pinMap->leftServoChannel());
        setValue(PITCH_LEFT_SERVO_PIN, pinMap->pitchLeft());
        setValue(PITCH_LEFT_SERVO_CHANNEL, pinMap->pitchLeftChannel());
        savePins();
    }

