jcfain/TCodeESP32/ESP32/lib/settingsFactory.h
    void syncSR6AndCommonPinsToDisk(const PinMapSR6* pinMap) 
    {
        if(!m_pinsFileInfo.initialized) {
            LogHandler::error(m_TAG, "syncSR6AndCommonPinsToDisk called before initialized");
            return;
        }
        syncCommonPinsToDoc(pinMap);
        setValue(RIGHT_SERVO_PIN, pinMap->rightServo());
        setValue(RIGHT_SERVO_CHANNEL, pinMap->rightServoChannel());
        setValue(LEFT_SERVO_PIN, pinMap->leftServo());
        setValue(LEFT_SERVO_CHANNEL, pinMap->leftServoChannel());
        setValue(PITCH_LEFT_SERVO_PIN, pinMap->pitchLeft());
        setValue(PITCH_LEFT_SERVO_CHANNEL, pinMap->pitchLeftChannel());
        setValue(PITCH_RIGHTSERVO_PIN, pinMap->pitchRight());
        setValue(PITCH_RIGHTSERVO_CHANNEL, pinMap->pitchRightChannel());
        setValue(RIGHT_UPPER_SERVO_PIN, pinMap->rightUpperServo());
        setValue(RIGHT_UPPER_SERVO_CHANNEL, pinMap->rightUpperServoChannel());
        setValue(LEFT_UPPER_SERVO_PIN, pinMap->leftUpperServo());
        setValue(LEFT_UPPER_SERVO_CHANNEL, pinMap->leftUpperServoChannel());
        savePins();
    }

    void initMessages() {
        for(SettingFileInfo* settingsInfo : AllSettings)
        {
            for(const Setting& setting : settingsInfo->settings)
            {
                sendMessage(setting.profiles.front(), setting.name);
            }
        }
    }
    void initSystemMessages(const char* name = 0) {
        if(name) {
            const Setting* setting = m_systemFileInfo.getSetting(name);
            if(!setting) {
                return;
            }
            sendMessage(setting->profiles.front(), name);
        } else {
            for(const Setting& setting : m_systemFileInfo.settings)
            {
                sendMessage(setting.profiles.front(), setting.name);
            }
        }
    }
    void initCommonMessages(const char* name = 0) {
        if(name) {
            const Setting* setting = m_commonFileInfo.getSetting(name);
            if(!setting) {
                return;
            }
            sendMessage(setting->profiles.front(), name);
        } else {
            for(const Setting& setting : m_commonFileInfo.settings)
            {
                sendMessage(setting.profiles.front(), setting.name);
            }
        }
    }
    void initWifiMessages(const char* name = 0) {
        if(name) {
            const Setting* setting = m_networkFileInfo.getSetting(name);
            if(!setting) {
                return;
            }
            sendMessage(setting->profiles.front(), name);
        } else {
            for(const Setting& setting : m_networkFileInfo.settings)
            {
                sendMessage(setting.profiles.front(), setting.name);
            }
        }
    }
    void initPinsMessages(const char* name = 0) {
        if(name) {
            const Setting* setting = m_pinsFileInfo.getSetting(name);
            if(!setting) {
                return;
            }
            sendMessage(setting->profiles.front(), name);
        } else {
            for(const Setting& setting : m_pinsFileInfo.settings)
            {
                sendMessage(setting.profiles.front(), setting.name);
            }
        }
    }

    // void toJsonVector(const Setting *setting, const std::vector<int> &value, JsonDocument &doc) 
    // {
    //     doc[setting->name] = value;
    //     // JsonArray array = doc[setting->name].add<JsonArray>();
    //     // for (size_t i = 0; i < value.size(); i++)
    //     // {
    //     //     array.add(value[i]);
    //     // }
    // }
    // void toJsonVector(const Setting *setting, const std::vector<const char*> &value, JsonDocument &doc) 
    // {
    //     doc[setting->name] = value;
    //     // JsonArray array = doc[setting->name].add<JsonArray>();
    //     // for (size_t i = 0; i < value.size(); i++)
    //     // {
    //     //     array.add(value[i]);
    //     // }
    // }
    
    template<typename T,
             typename = 
                std::enable_if
                <
                    !std::is_const<T>::value || 
                    std::is_integral<T>::value || 
                    std::is_floating_point<T>::value || 
                    std::is_same<T, bool>::value 
                    // || std::is_same<T, std::vector<const char*>>::value 
                    // || std::is_same<T, std::vector<const int>>::value
                >
            >
    void toJson(const Setting *setting, JsonDocument &doc, T value) {
        switch(setting->type)
        {
            case SettingType::Boolean: {
                doc[setting->name] = static_cast<bool>(value);
                LogHandler::verbose(m_TAG, "Load bool: %s, value: %ld", setting->name, doc[setting->name].as<bool>());
            }
            break;
            case SettingType::Number: {
                doc[setting->name] = static_cast<int>(value);
                LogHandler::verbose(m_TAG, "Load number: %s, value: %ld", setting->name, doc[setting->name].as<int>());
            }
            break;
            case SettingType::Double: {
                doc[setting->name] = static_cast<double>(value);
                LogHandler::verbose(m_TAG, "Load double: %s, value: %f", setting->name, doc[setting->name].as<double>());
            }
            break;
            case SettingType::Float: {
                doc[setting->name] = static_cast<float>(value);
                LogHandler::verbose(m_TAG, "Load float: %s, value: %f", setting->name, doc[setting->name].as<float>());
            }
            break;
            case SettingType::String: {
                doc[setting->name] = static_cast<char*>(value);
                LogHandler::verbose(m_TAG, "Load string: %s, value: %s", setting->name, doc[setting->name].as<const char*>());
            }
            break;
            // case SettingType::ArrayString: {
            //     doc[setting->name] = static_cast<const std::vector<const char*>>(value);
            //     LogHandler::verbose(m_TAG, "Load array string: %s, value size: %ld", setting->name, doc[setting->name].as<const std::vector<const char*>>().size());
            // }
            // break;
            // case SettingType::ArrayInt: {
            //     doc[setting->name] = static_cast<const std::vector<int>>(value);
            //     LogHandler::verbose(m_TAG, "Load array int: %s, value size: %ld", setting->name, doc[setting->name].as<const std::vector<const int>>().size());
            // }
            break;
        }
    }
    void defaultToJson(const Setting *setting, JsonDocument &doc) {
        switch(setting->type)
        {
            case SettingType::Boolean: {
                doc[setting->name] = mpark::get<const bool>(setting->defaultValue);
                LogHandler::verbose(m_TAG, "Load default bool: %s, value: %ld", setting->name, doc[setting->name].as<bool>());
            }
            break;
            case SettingType::Number: {
                doc[setting->name] = mpark::get<const int>(setting->defaultValue);
                LogHandler::verbose(m_TAG, "Load default number: %s, value: %ld", setting->name, doc[setting->name].as<int>());
            }
            break;
            case SettingType::Double: {
                doc[setting->name] = mpark::get<const double>(setting->defaultValue);
                LogHandler::verbose(m_TAG, "Load default double: %s, value: %f", setting->name, doc[setting->name].as<double>());
            }
            break;
            case SettingType::Float: {
                doc[setting->name] = mpark::get<const float>(setting->defaultValue);
                LogHandler::verbose(m_TAG, "Load default float: %s, value: %f", setting->name, doc[setting->name].as<float>());
            }
            break;
            case SettingType::String: {
                doc[setting->name] = mpark::get<const char*>(setting->defaultValue);
                LogHandler::verbose(m_TAG, "Load default string: %s, value: %s", setting->name, doc[setting->name].as<const char*>());
            }
            break;
            case SettingType::ArrayString: {
                loadDefaultVector(setting, doc);
                LogHandler::verbose(m_TAG, "Load default string vector: %s, value size: %ld", setting->name, doc[setting->name].as<JsonArray>().size());
            }
            break;
            case SettingType::ArrayInt: {
                loadDefaultVector(setting, doc);
                LogHandler::verbose(m_TAG, "Load default int vector: %s, value size: %ld", setting->name, doc[setting->name].as<JsonArray>().size());
            }
            break;
            case SettingType::NONE: 
            break;
            case SettingType::MAX: 
            break;
        }
    }
    
    void sendMessage(const SettingProfile &profile, const char *message)
    {
        if (message_callback)
        {
            //LogHandler::debug(m_TAG, "sendMessage: message_callback profile %ld: %s", (int)profile, message);
            message_callback(profile, message);
        }
        else
        {
            LogHandler::warning(m_TAG, "sendMessage: message_callback 0");
        }
    }

    bool createJsonFile(const char* path) {
        LogHandler::info(m_TAG, "Creating file %s", path);
        if(LittleFS.exists(path)) {
            LogHandler::info(m_TAG, "File exists, Deleting file %s", path);
            if(!LittleFS.remove(path)) {
                LogHandler::error(m_TAG, "Error deleting %s!", path);
                return false;
            }
        }
        File newFile = LittleFS.open(path, FILE_WRITE, true);
        if(!newFile) {
            LogHandler::error(m_TAG, "Error creating %s!", path);
            return false;
        }
        newFile.print("{}");
        newFile.flush();
        newFile.close();
        return true;
    }
    
    bool deleteJsonFile(const char* path) {
        if(LittleFS.exists(path)) {
            LogHandler::info(m_TAG, "Deleting file %s", path);
            if(!LittleFS.remove(path)) {
                LogHandler::error(m_TAG, "Error deleting %s!", path);
                return false;
            }
        }
        return true;
    }
};
